In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
import sklearn

In [4]:
from sklearn.preprocessing import LabelEncoder

In [5]:
#read file




data=pd.read_csv("/Users/Nandu/Documents/OneDrive/Documents/new era/PinNPark/ML/train_data.csv")

In [6]:
data.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y
3,LP001006,Male,Yes,0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y
4,LP001008,Male,No,0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y

In [7]:
#Seperate labels and features
y=LabelEncoder().fit_transform(data["Loan_Status"])
x=data.drop('Loan_Status',1)

y=LabelEncoder().fit_transform(data["Loan_Status"])

In [8]:
#y

In [9]:
x.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area
0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural
2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban
3,LP001006,Male,Yes,0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban
4,LP001008,Male,No,0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban

In [10]:
y.shape

(614,)

In [11]:
def conv_to_num(data):
    #convert to categories
    x=data
    for columns in data.columns:
        x[columns]=data[columns].astype('category')
    
        
    #convert to numerical
    for columns in data.columns:
        x[columns]=data[columns].cat.codes #missing values??
    return x

In [12]:
x.shape

(614, 12)

In [13]:
x=conv_to_num(x)
x.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area
0,0,1,0,0,0,0,376,0,-1,8,1,2
1,1,1,1,1,0,0,306,60,81,8,1,0
2,2,1,1,0,0,1,139,0,26,8,1,2
3,3,1,1,0,1,0,90,160,73,8,1,2
4,4,1,0,0,0,0,381,0,94,8,1,2

In [14]:
x.shape

(614, 12)

In [15]:
print(x.dtypes)

Loan_ID              int16
Gender                int8
Married               int8
Dependents            int8
Education             int8
Self_Employed         int8
ApplicantIncome      int16
CoapplicantIncome    int16
LoanAmount           int16
Loan_Amount_Term      int8
Credit_History        int8
Property_Area         int8
dtype: object

In [16]:
x.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area
0,0,1,0,0,0,0,376,0,-1,8,1,2
1,1,1,1,1,0,0,306,60,81,8,1,0
2,2,1,1,0,0,1,139,0,26,8,1,2
3,3,1,1,0,1,0,90,160,73,8,1,2
4,4,1,0,0,0,0,381,0,94,8,1,2

In [17]:
from sklearn import tree

In [18]:
clf=tree.DecisionTreeClassifier()

In [19]:
clf=clf.fit(x,y)

In [20]:
x.shape

(614, 12)

In [21]:
data_test=pd.read_csv("/Users/Nandu/Documents/OneDrive/Documents/new era/PinNPark/ML/test_data.csv")

In [22]:
data_test.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area
0,LP001015,Male,Yes,0,Graduate,No,5720,0,110.0,360.0,1.0,Urban
1,LP001022,Male,Yes,1,Graduate,No,3076,1500,126.0,360.0,1.0,Urban
2,LP001031,Male,Yes,2,Graduate,No,5000,1800,208.0,360.0,1.0,Urban
3,LP001035,Male,Yes,2,Graduate,No,2340,2546,100.0,360.0,NaN,Urban
4,LP001051,Male,No,0,Not Graduate,No,3276,0,78.0,360.0,1.0,Urban

In [23]:
data_test.shape

(367, 12)

In [24]:
#data_num=data_test
#data_test

In [25]:
temp=data_test.copy()
#data_test
x_test=conv_to_num(temp)#NOt a good move

In [26]:
#temp

In [27]:
x_test.shape

(367, 12)

In [28]:
x_test.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area
0,0,1,1,0,0,0,251,0,52,10,1,2
1,1,1,1,1,0,0,102,43,67,10,1,2
2,2,1,1,2,0,0,230,67,119,10,1,2
3,3,1,1,2,0,0,43,110,42,10,-1,2
4,4,1,0,0,1,0,120,0,25,10,1,2

In [29]:
y_test=clf.predict(x_test)

In [30]:
y_test.dtype

dtype('int64')

In [31]:
y_result=[]
i=0;

for i in range(len(y_test)):
    
    if y_test[i]==0:
        y_result.append("N")
       # print"test"
            
    elif y_test[i]==1:
        y_result.append("Y")
       # print(y_test[i])
        #print"test"

In [32]:
y_result=pd.DataFrame(y_result)

In [33]:
y_result.columns=["Loan_Status"]
y_result.head()

  Loan_Status
0           N
1           Y
2           Y
3           Y
4           N

In [34]:
y_result.shape

(367, 1)

In [35]:
data_test.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area
0,LP001015,Male,Yes,0,Graduate,No,5720,0,110.0,360.0,1.0,Urban
1,LP001022,Male,Yes,1,Graduate,No,3076,1500,126.0,360.0,1.0,Urban
2,LP001031,Male,Yes,2,Graduate,No,5000,1800,208.0,360.0,1.0,Urban
3,LP001035,Male,Yes,2,Graduate,No,2340,2546,100.0,360.0,NaN,Urban
4,LP001051,Male,No,0,Not Graduate,No,3276,0,78.0,360.0,1.0,Urban

In [36]:
data_result=pd.concat([data_test,y_result],1)

In [37]:
data_result.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001015,Male,Yes,0,Graduate,No,5720,0,110.0,360.0,1.0,Urban,N
1,LP001022,Male,Yes,1,Graduate,No,3076,1500,126.0,360.0,1.0,Urban,Y
2,LP001031,Male,Yes,2,Graduate,No,5000,1800,208.0,360.0,1.0,Urban,Y
3,LP001035,Male,Yes,2,Graduate,No,2340,2546,100.0,360.0,NaN,Urban,Y
4,LP001051,Male,No,0,Not Graduate,No,3276,0,78.0,360.0,1.0,Urban,N

In [38]:
data_result.to_csv("/Users/Nandu/Documents/OneDrive/Documents/new era/PinNPark/ML/train_result.csv")

In [39]:
from sklearn.model_selection import train_test_split

In [40]:
xv_train,xv_test,yv_train,yv_test=train_test_split(x,y,test_size=.5)

In [41]:
xv_train.shape

(307, 12)

In [42]:
clf=clf.fit(xv_train,yv_train)

In [43]:
from sklearn.metrics import accuracy_score

In [44]:
print accuracy_score(clf.predict(xv_test),yv_test)

0.71661237785

In [45]:
from sklearn.naive_bayes import GaussianNB

In [46]:
model_nb = GaussianNB()

In [47]:

model_nb=model_nb.fit(x,y)

In [48]:
print accuracy_score(model_nb.predict(xv_test),yv_test)

0.661237785016

In [49]:
from sklearn.linear_model import LogisticRegression

In [50]:
model_lg=LogisticRegression()

In [51]:
model_lg=model_lg.fit(x,y)
print accuracy_score(model_lg.predict(xv_test),yv_test)

0.651465798046